---
kind: type
id: T:Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode
source: html/946277c7-6e1a-7f6a-7bd3-7693904e74fd.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode

Defines modes which can be used by a SpatialFieldPrimitive to hide the original referenced element.

## Syntax (C#)
```csharp
public enum SpatialFieldPrimitiveHideMode
```